Reports/ДиагностикаБизнеса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Report>
		<Properties>
			<Name>ДиагностикаБизнеса</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/СтатусСпецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СтатусСпецификации</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСпецификации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Спецификация</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ПакетыУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ПакетыУслуг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДоставкаДоКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставкаДоКлиентаИМонтаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставкаДоОфиса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставкаДоТранспортнойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СамовывозОтПроизводителя</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыСпецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>СтатусыСпецификации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Изготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеМатериала</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданВЦех</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проверяется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Размещен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассчитывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сохранен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Установлен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Замер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>Замер</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПродажиФакт</xr:Item>
				<xr:Item>InformationRegister.ГрафикВстречИЗамеров</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЗамера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗамера</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриемаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Замерщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяЗаказчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Километраж</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСпецификаций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткудаПришел</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Офис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Офисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервыйЗамер</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Замер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Договор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>Договор</Name>
			<BasedOn>
				<xr:Item>Document.Спецификация</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПродажиФакт</xr:Item>
				<xr:Item>AccumulationRegister.РеализованныеИзделия</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановитьНеПозднее</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорСЮрЛицом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗарплатаДизайнера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцевРассрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Офис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Офисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поделиться</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Спецификация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокументаБезСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Рассрочка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/АктВыполненияДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>АктВыполненияДоговора</Name>
			<BasedOn>
				<xr:Item>Document.Договор</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПередачи</Name>
					<Comment>Дата передачи акта на хранение</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Договор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийСупервайзера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаХранение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОценкаСупервайзера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОценкаСупервайзера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Супервайзер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ДиагностикаБизнеса/Ext/ManagerModule.bsl
Функция СформироватьОтчет(ПараметрыОтчета) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДокСлужебок = Новый ТабличныйДокумент;
	
	ТабДок.АвтоМасштаб = Истина;
	
	Макет = Отчеты.ДиагностикаБизнеса.ПолучитьМакет("Макет");
	
	Тело = Макет.ПолучитьОбласть("Тело|КолонкиТело");
	СтрокаПодразделение = Макет.ПолучитьОбласть("СтрокаПодразделение|КолонкиТело");
	
	ОбластьМонтаж = Макет.ПолучитьОбласть("ОбластьМонтаж|КолонкиТело");
	ОбластьАкт = Макет.ПолучитьОбласть("ОбластьАкт|КолонкиТело");
	ОбластьЦех = Макет.ПолучитьОбласть("ОбластьЦех|КолонкиТело");
	ОбластьОтгружено = Макет.ПолучитьОбласть("ОбластьОтгружено|КолонкиТело");
	ОбластьРассчитано = Макет.ПолучитьОбласть("ОбластьРассчитано|КолонкиТело");
	
	СтрокаДоговор = Макет.ПолучитьОбласть("ШапкаДоговор|КолонкиДоговор");
	СтрокаАкт = Макет.ПолучитьОбласть("ШапкаАкт|КолонкиАкт");
	ШапкаСлужебок = Макет.ПолучитьОбласть("ШапкаСлужебок|КолонкиСлужебок");
	СтрокаСлужебок = Макет.ПолучитьОбласть("СтрокаСлужебок|КолонкиСлужебок"); 
	ШапкаСпецификации = Макет.ПолучитьОбласть("ШапкаСпецификация|КолонкиВыпуска");
	ШапкаВыпуска = Макет.ПолучитьОбласть("ШапкаВыпуск|КолонкиВыпуска");
	
	#Область Запрос_отчета
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаОтчета", ПараметрыОтчета.Дата);	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	спрСпецификация.ДатаМонтажа КАК ДатаМонтажа,
	|	докДоговор.Спецификация,
	|	докДоговор.Номер КАК НомерДоговора,
	|	докДоговор.Спецификация.Номер КАК НомерСпецификации,
	|	докДоговор.Спецификация.Изделие КАК ВидИзделия,
	|	спрСпецификация.Монтажник КАК Монтажник,
	|	спрСпецификация.ДовозОсуществил КАК Экспедитор,
	|	докДоговор.Автор.ФизическоеЛицо КАК Дизайнер,
	|	ВЫРАЗИТЬ(докДоговор.Спецификация.ДокументОснование КАК Документ.Замер).Замерщик КАК Замерщик,
	|	докДоговор.Спецификация.АдресМонтажа КАК Адрес,
	|	докДоговор.Спецификация.Производство КАК Подразделение,
	|	докДоговор.Ссылка КАК Договор,
	|	ВЫБОР
	|		КОГДА докАктВыполненияДоговора.Ссылка ЕСТЬ NULL 
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Порядок,
	|	докАктВыполненияДоговора.Номер КАК НомерАкта,
	|	докАктВыполненияДоговора.Ссылка КАК Акт,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаИзготовления,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОтгрузки,
	|	докДоговор.Контрагент.Наименование КАК Контрагент,
	|	докДоговор.Контрагент.Телефон + "", "" + докДоговор.Контрагент.ТелефонДополнительный КАК Телефон,
	|	докАктВыполненияДоговора.Автор.ФизическоеЛицо.Фамилия + "" "" + ПОДСТРОКА(докАктВыполненияДоговора.Автор.ФизическоеЛицо.Имя, 1, 1) + "". "" + ПОДСТРОКА(докАктВыполненияДоговора.Автор.ФизическоеЛицо.Отчество, 1, 1) + ""."" КАК АвторАкта
	|ПОМЕСТИТЬ ВТ_Доки
	|ИЗ
	|	Документ.Договор КАК докДоговор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АктВыполненияДоговора КАК докАктВыполненияДоговора
	|		ПО (докАктВыполненияДоговора.Договор = докДоговор.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Спецификация КАК спрСпецификация
	|		ПО докДоговор.Спецификация = спрСпецификация.Ссылка
	|ГДЕ
	|	докДоговор.Спецификация.ПакетУслуг = ЗНАЧЕНИЕ(Перечисление.ПакетыУслуг.ДоставкаДоКлиентаИМонтаж)
	|	И спрСпецификация.ДатаМонтажа <= &ДатаОтчета
	|	И (докАктВыполненияДоговора.Дата ЕСТЬ NULL 
	|			ИЛИ докАктВыполненияДоговора.ДатаПередачи = ДАТАВРЕМЯ(1, 1, 1)
	|				И докАктВыполненияДоговора.Дата <= &ДатаОтчета)
	|	И докДоговор.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	докСпецификация.Ссылка,
	|	NULL,
	|	докСпецификация.Номер,
	|	докСпецификация.Изделие,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	докСпецификация.АдресМонтажа,
	|	докСпецификация.Производство,
	|	NULL,
	|	3,
	|	NULL,
	|	NULL,
	|	докСпецификация.ДатаИзготовления,
	|	NULL,
	|	докСпецификация.Контрагент.Наименование,
	|	докСпецификация.Контрагент.Телефон + "", "" + докСпецификация.Контрагент.ТелефонДополнительный,
	|	NULL
	|ИЗ
	|	Документ.Спецификация КАК докСпецификация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыпускПродукции.СписокСпецификаций КАК ВыпускПродукцииСписокСпецификаций
	|		ПО (ВыпускПродукцииСписокСпецификаций.Спецификация = докСпецификация.Ссылка)
	|ГДЕ
	|	докСпецификация.ДатаИзготовления <= &ДатаОтчета
	|	И ВыпускПродукцииСписокСпецификаций.Ссылка ЕСТЬ NULL 
	|	И докСпецификация.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	докСпецификация.Ссылка,
	|	NULL,
	|	докСпецификация.Номер,
	|	докСпецификация.Изделие,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	докСпецификация.АдресМонтажа,
	|	докСпецификация.Производство,
	|	NULL,
	|	4,
	|	NULL,
	|	NULL,
	|	NULL,
	|	докСпецификация.ДатаОтгрузки,
	|	докСпецификация.Контрагент.Наименование,
	|	докСпецификация.Контрагент.Телефон + "", "" + докСпецификация.Контрагент.ТелефонДополнительный,
	|	NULL
	|ИЗ
	|	Документ.Спецификация КАК докСпецификация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияГотовойПродукции.СписокСпецификаций КАК РеализацияГотовойПродукцииСписокСпецификаций
	|		ПО (РеализацияГотовойПродукцииСписокСпецификаций.Спецификация = докСпецификация.Ссылка)
	|ГДЕ
	|	докСпецификация.ДатаОтгрузки <= &ДатаОтчета
	|	И РеализацияГотовойПродукцииСписокСпецификаций.Ссылка ЕСТЬ NULL 
	|	И докСпецификация.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	докСпецификация.Ссылка,
	|	NULL,
	|	докСпецификация.Номер,
	|	докСпецификация.Изделие,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	докСпецификация.АдресМонтажа,
	|	докСпецификация.Производство,
	|	NULL,
	|	5,
	|	NULL,
	|	NULL,
	|	докСпецификация.ДатаИзготовления,
	|	докСпецификация.ДатаОтгрузки,
	|	докСпецификация.Контрагент.Наименование,
	|	докСпецификация.Контрагент.Телефон + "", "" + докСпецификация.Контрагент.ТелефонДополнительный,
	|	NULL
	|ИЗ
	|	Документ.Спецификация КАК докСпецификация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусСпецификации.СрезПоследних КАК СтатусСпецификацииСрезПоследних
	|		ПО (СтатусСпецификацииСрезПоследних.Спецификация = докСпецификация.Ссылка)
	|ГДЕ
	|	СтатусСпецификацииСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификации.Рассчитывается)
	|	И РАЗНОСТЬДАТ(докСпецификация.ДатаИзготовления, &ДатаОтчета, ДЕНЬ) > 2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Доки.Спецификация КАК Спецификация,
	|	ВТ_Доки.НомерДоговора,
	|	ВТ_Доки.НомерСпецификации,
	|	ВТ_Доки.ВидИзделия,
	|	ВТ_Доки.Дизайнер,
	|	ВТ_Доки.Замерщик,
	|	ВЫБОР
	|		КОГДА ВТ_Доки.Адрес = ""Введите адрес""
	|			ТОГДА ""Адрес не указан""
	|		ИНАЧЕ ВТ_Доки.Адрес
	|	КОНЕЦ КАК Адрес,
	|	ВТ_Доки.Подразделение КАК Подразделение,
	|	ВТ_Доки.Договор КАК Договор,
	|	ВТ_Доки.Порядок КАК Порядок,
	|	ВТ_Доки.НомерАкта,
	|	ВТ_Доки.Акт,
	|	ВТ_Доки.ДатаИзготовления КАК ДатаИзготовления,
	|	СлужебнаяЗаписка.Ссылка КАК СЗ,
	|	Заметки.ТекстСодержания КАК Текст,
	|	ВТ_Доки.Контрагент,
	|	ВТ_Доки.Телефон,
	|	ВТ_Доки.АвторАкта,
	|	ВТ_Доки.ДатаМонтажа,
	|	ВТ_Доки.Монтажник,
	|	ВТ_Доки.Экспедитор
	|ИЗ
	|	ВТ_Доки КАК ВТ_Доки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Заметки КАК Заметки
	|		ПО (ВТ_Доки.Спецификация = (ВЫРАЗИТЬ(Заметки.Предмет КАК Документ.Спецификация)))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СлужебнаяЗаписка КАК СлужебнаяЗаписка
	|		ПО (ВТ_Доки.Договор = СлужебнаяЗаписка.Документ
	|				ИЛИ ВТ_Доки.Спецификация = СлужебнаяЗаписка.Документ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	ДатаИзготовления
	|ИТОГИ ПО
	|	Подразделение,
	|	Порядок,
	|	Спецификация";
		
	#КонецОбласти
	
	ВыборкаПоПодразделениям = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоПодразделениям.Следующий() Цикл
		
		СтрокаПодразделение.Параметры.Заполнить(ВыборкаПоПодразделениям);				
		ТабДок.Вывести(СтрокаПодразделение);	
		ТабДок.НачатьГруппуСтрок();	
		
		ВыборкаПоПорядку = ВыборкаПоПодразделениям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоПорядку.Следующий() Цикл
			
			Если ВыборкаПоПорядку.Порядок = 1 Тогда
				ТабДок.Вывести(ОбластьМонтаж);
			ИначеЕсли ВыборкаПоПорядку.Порядок = 2 Тогда
				ТабДок.Вывести(ОбластьАкт);
			ИначеЕсли ВыборкаПоПорядку.Порядок = 3 Тогда
				ТабДок.Вывести(ОбластьЦех);
			ИначеЕсли ВыборкаПоПорядку.Порядок = 4 Тогда
				ТабДок.Вывести(ОбластьОтгружено);
			ИначеЕсли ВыборкаПоПорядку.Порядок = 5 Тогда
				ТабДок.Вывести(ОбластьРассчитано);				
			КонецЕсли;
						
			ТабДок.НачатьГруппуСтрок();
			
			ВыборкаПоСпецификациям = ВыборкаПоПорядку.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоСпецификациям.Следующий() Цикл
				
				Выборка = ВыборкаПоСпецификациям.Выбрать();
				
				Выборка.Следующий();
				
				Тело.Параметры.Заполнить(Выборка);
				
				Если ЗначениеЗаполнено(Выборка.Договор) Тогда
					
					СтрокаДоговор.Параметры.Заполнить(Выборка);
					СтрокаДоговор.Параметры.РасшифровкаСпецификация = Новый Структура("Спецификация", Выборка.Спецификация);
					СтрокаДоговор.Параметры.РасшифровкаДоговор = Новый Структура("Договор", Выборка.Договор);
					ТабДок.Вывести(СтрокаДоговор);
					
				Иначе
					
					ШапкаСпецификации.Параметры.Заполнить(Выборка);
					ШапкаСпецификации.Параметры.РасшифровкаСпецификация = Новый Структура("Спецификация", Выборка.Спецификация);
					ТабДок.Вывести(ШапкаСпецификации);
					
				КонецЕсли;
				
				ШапкаСлужебок.Параметры.Расшифровка = Новый Структура("Ссылка, Текст", Выборка.Спецификация, Выборка.Текст);					
				
				Если ЗначениеЗаполнено(Выборка.ДатаИзготовления) И ВыборкаПоПорядку.Порядок = 3 Тогда
					
					ШапкаВыпуска.Параметры.ДатаИзготовления = Формат(Выборка.ДатаИзготовления,"ДЛФ=DD");
					ТабДок.Вывести(ШапкаВыпуска);
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Выборка.НомерАкта) Тогда
					
					СтрокаАкт.Параметры.Заполнить(Выборка);
					СтрокаАкт.Параметры.РасшифровкаАкта = Новый Структура("Акт", Выборка.Акт);
					ТабДок.Вывести(СтрокаАкт);
					
				КонецЕсли;
				
				ТабДок.Вывести(Тело);
				
				Выборка.Сбросить();
				
				ТабДокСлужебок.Очистить();
				ТабДокСлужебок.Вывести(ШапкаСлужебок);
				
				Пока Выборка.Следующий() Цикл
					
					СтрокаСлужебок.Параметры.Заполнить(Выборка);
					СтрокаСлужебок.Параметры.РасшифровкСЗ = Новый Структура("Служебка", Выборка.СЗ);
					ТабДокСлужебок.Вывести(СтрокаСлужебок);
					
				КонецЦикла;
				
				ТабДок.Присоединить(ТабДокСлужебок);
				
			КонецЦикла;
			
			ТабДок.ЗакончитьГруппуСтрок();
			
		КонецЦикла;
		
		ТабДок.ЗакончитьГруппуСтрок();
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции
